# -*- coding: utf-8 -*-
"""lesson5.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1x-RzS5VjjJ5UVsehoLsHVgvIsQhqeT5Q
"""

#Задание 1
def check_palindrom(in_string):
  in_string = in_string.lower().replace(" ", "")
  if in_string == in_string[::-1]:
    res = True
  else:
    res = False
  return res

print(check_palindrom(input()))
# А роза упала на лапу Азора

#Задание 2
def titlelabel(surname, name, patr, age):
  return surname + ' ' + name + ' ' + patr + ' ' + str(2023 - int(age)) + ' г.р. ' + 'зарегистрирован'

print("Введите фамилию:")
surname = input()
print("Введите имя:")
name = input()
print("Введите отчество:")
patr = input()
print("Введите возраст:")
age = input()
print(titlelabel(surname, name, patr, age))

#Задание 3
# м.б., я неверно понял задание. Если да, напишите - я поправлю.
def maximum(num1, num2, num3 = 100):
  res = num1 if num1 > num2 else num2
  res = res if res > num3 else num3
  return res

print(maximum(60, 15))